# Symbol Type Id MBtu Property

Source: https://www.revitapidocs.com/2026/5dbe064b-77ec-f8b1-142a-0621a086e364.htm

---

| Symbol Type Id MBtu Property |
| --- |

Symbol MBtu, indicating unit Million British thermal units.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MBtu { get; }
```

```
Public Shared ReadOnly Property MBtu As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MBtu {
	ForgeTypeId^ get ();
}
```

```
static member MBtu : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

SymbolTypeId Class Autodesk.Revit.DB Namespace